____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 32, 32, 32, 1) 0                                            
____________________________________________________________________________________________________
dropout_1 (Dropout)              (None, 32, 32, 32, 1) 0           input_1[0][0]                    
____________________________________________________________________________________________________
average_pooling3d_1 (AveragePool (None, 16, 32, 32, 1) 0           dropout_1[0][0]                  
____________________________________________________________________________________________________
conv1 (Conv3D)                   (None, 16, 32, 32, 64 1792        average_pooling3d_1[0][0]        
____________________________________________________________________________________________________
pool1 (MaxPooling3D)             (None, 16, 16, 16, 64 0           conv1[0][0]                      
____________________________________________________________________________________________________
dropout_2 (Dropout)              (None, 16, 16, 16, 64 0           pool1[0][0]                      
____________________________________________________________________________________________________
conv2 (Conv3D)                   (None, 16, 16, 16, 12 221312      dropout_2[0][0]                  
____________________________________________________________________________________________________
pool2 (MaxPooling3D)             (None, 8, 8, 8, 128)  0           conv2[0][0]                      
____________________________________________________________________________________________________
dropout_3 (Dropout)              (None, 8, 8, 8, 128)  0           pool2[0][0]                      
____________________________________________________________________________________________________
conv3a (Conv3D)                  (None, 8, 8, 8, 256)  884992      dropout_3[0][0]                  
____________________________________________________________________________________________________
conv3b (Conv3D)                  (None, 8, 8, 8, 256)  1769728     conv3a[0][0]                     
____________________________________________________________________________________________________
pool3 (MaxPooling3D)             (None, 4, 4, 4, 256)  0           conv3b[0][0]                     
____________________________________________________________________________________________________
dropout_4 (Dropout)              (None, 4, 4, 4, 256)  0           pool3[0][0]                      
____________________________________________________________________________________________________
conv4a (Conv3D)                  (None, 4, 4, 4, 512)  3539456     dropout_4[0][0]                  
____________________________________________________________________________________________________
conv4b (Conv3D)                  (None, 4, 4, 4, 512)  7078400     conv4a[0][0]                     
____________________________________________________________________________________________________
pool4 (MaxPooling3D)             (None, 2, 2, 2, 512)  0           conv4b[0][0]                     
____________________________________________________________________________________________________
dropout_5 (Dropout)              (None, 2, 2, 2, 512)  0           pool4[0][0]                      
____________________________________________________________________________________________________
last_64 (Conv3D)                 (None, 1, 1, 1, 64)   262208      dropout_5[0][0]                  
____________________________________________________________________________________________________
out_class_last (Conv3D)          (None, 1, 1, 1, 1)    65          last_64[0][0]                    
____________________________________________________________________________________________________
out_malignancy_last (Conv3D)     (None, 1, 1, 1, 1)    65          last_64[0][0]                    
____________________________________________________________________________________________________
out_class (Flatten)              (None, 1)             0           out_class_last[0][0]             
____________________________________________________________________________________________________
out_malignancy (Flatten)         (None, 1)             0           out_malignancy_last[0][0]        
====================================================================================================
Total params: 13,758,018
Trainable params: 13,758,018
Non-trainable params: 0
____________________________________________________________________________________________________
